[options]
mode cover
depth 100

[engines]
smtbmc boolector

[script]
verilog_defines -D RISCV_FORMAL
verilog_defines -D RISCV_FORMAL_NRET=1
verilog_defines -D RISCV_FORMAL_XLEN=32
verilog_defines -D RISCV_FORMAL_ILEN=32
verilog_defines -D RISCV_FORMAL_COMPRESSED
verilog_defines -D RISCV_FORMAL_ALIGNED_MEM
read_verilog -sv rvfi_macros.vh
read_verilog -sv Cl1Top.sv
read_verilog -sv -formal cover.sv
prep -nordff -top testbench

[files]
../../checks/rvfi_macros.vh
Cl1Top.sv
cover.sv
